MikroElektronika/core_packages/ARM/gcc_clang/system/src/ti/mspm0l2/thirdparty/mspm0l2/ti/devices/msp/peripherals/hw_uart.h
/* UART_LINC0 Bits */
/* UART_LINC0[DATA] Bits */
#define UART_LINC0_DATA_OFS                      (0)                             /* !< DATA Offset */
#define UART_LINC0_DATA_MASK                     ((uint32_t)0x0000FFFFU)         /* !< 16 Bit Capture / Compare Register
                                                                                    Captures current LINCTR value on RXD
                                                                                    falling edge and can generate a LINC0
                                                                                    interrupt when capture is enabled
                                                                                    (LINC0CAP = 1).  If compare mode is
                                                                                    enabled (LINC0_MATCH = 1), a counter
                                                                                    match can generate a LINC0 interrupt. */
#define UART_LINC0_DATA_MINIMUM                  ((uint32_t)0x00000000U)         /* !< Smallest value */
#define UART_LINC0_DATA_MAXIMUM                  ((uint32_t)0x0000FFFFU)         /* !< Highest possible value */

/* UART_LINC1 Bits */
/* UART_LINC1[DATA] Bits */
#define UART_LINC1_DATA_OFS                      (0)                             /* !< DATA Offset */
#define UART_LINC1_DATA_MASK                     ((uint32_t)0x0000FFFFU)         /* !< 16 Bit Capture / Compare Register
                                                                                    Captures current LINCTR value on RXD
                                                                                    rising edge and can generate a LINC1
                                                                                    interrupt when capture is enabled
                                                                                    (LINC1CAP = 1) */
#define UART_LINC1_DATA_MINIMUM                  ((uint32_t)0x00000000U)         /* !< Smallest value */
#define UART_LINC1_DATA_MAXIMUM                  ((uint32_t)0x0000FFFFU)         /* !< Highest possible value */

/* UART_IRCTL Bits */
/* UART_IRCTL[IRTXPL] Bits */
#define UART_IRCTL_IRTXPL_OFS                    (2)                             /* !< IRTXPL Offset */
#define UART_IRCTL_IRTXPL_MASK                   ((uint32_t)0x000000FCU)         /* !< Transmit pulse length. Pulse length
                                                                                    t(PULSE) = (IRTXPLx + 1) / [2 *
                                                                                    f(IRTXCLK)] (IRTXCLK = functional
                                                                                    clock of the UART) */
#define UART_IRCTL_IRTXPL_MINIMUM                ((uint32_t)0x00000000U)         /* !< Smallest value */
#define UART_IRCTL_IRTXPL_MAXIMUM                ((uint32_t)0x000000FCU)         /* !< Highest possible value */
/* UART_IRCTL[IRRXPL] Bits */
#define UART_IRCTL_IRRXPL_OFS                    (9)                             /* !< IRRXPL Offset */
#define UART_IRCTL_IRRXPL_MASK                   ((uint32_t)0x00000200U)         /* !< IrDA receive input UCAxRXD polarity */
#define UART_IRCTL_IRRXPL_HIGH                   ((uint32_t)0x00000000U)         /* !< IrDA transceiver delivers a high
                                                                                    pulse when a light pulse is seen */
#define UART_IRCTL_IRRXPL_LOW                    ((uint32_t)0x00000200U)         /* !< IrDA transceiver delivers a low
                                                                                    pulse when a light pulse is seen */
/* UART_IRCTL[IREN] Bits */
#define UART_IRCTL_IREN_OFS                      (0)                             /* !< IREN Offset */
#define UART_IRCTL_IREN_MASK                     ((uint32_t)0x00000001U)         /* !< IrDA encoder/decoder enable */
#define UART_IRCTL_IREN_DISABLE                  ((uint32_t)0x00000000U)         /* !< IrDA encoder/decoder disabled */
#define UART_IRCTL_IREN_ENABLE                   ((uint32_t)0x00000001U)         /* !< IrDA encoder/decoder enabled */
/* UART_IRCTL[IRTXCLK] Bits */
#define UART_IRCTL_IRTXCLK_OFS                   (1)                             /* !< IRTXCLK Offset */
#define UART_IRCTL_IRTXCLK_MASK                  ((uint32_t)0x00000002U)         /* !< IrDA transmit pulse clock select */
#define UART_IRCTL_IRTXCLK_BITCLK                ((uint32_t)0x00000000U)         /* !< IrDA encode data is based on the
                                                                                    functional clock. */
#define UART_IRCTL_IRTXCLK_BRCLK                 ((uint32_t)0x00000002U)         /* !< IrDA encode data is based on the
                                                                                    Baud Rate clock< when select 8x
                                                                                    oversampling, the IRTXPL cycle should
                                                                                    less 8;  when select 16x
                                                                                    oversampling, the IRTXPL cycle should
                                                                                    less 16. */

/* UART_AMASK Bits */
/* UART_AMASK[VALUE] Bits */
#define UART_AMASK_VALUE_OFS                     (0)                             /* !< VALUE Offset */
#define UART_AMASK_VALUE_MASK                    ((uint32_t)0x000000FFU)         /* !< Self Address Mask for 9-Bit Mode
                                                                                    This field contains the address mask
                                                                                    that creates a set of addresses that
                                                                                    should be matched.  A 0 bit in the
                                                                                    MSK bitfield configures, that the
                                                                                    corresponding bit in the ADDR
                                                                                    bitfield of the UARTxADDR register is
                                                                                    don't care. A 1 bit in the MSK
                                                                                    bitfield configures, that the
                                                                                    corresponding bit in the ADDR
                                                                                    bitfield of the UARTxADDR register
                                                                                    must match. */
#define UART_AMASK_VALUE_MINIMUM                 ((uint32_t)0x00000000U)         /* !< Smallest value */
#define UART_AMASK_VALUE_MAXIMUM                 ((uint32_t)0x000000FFU)         /* !< Highest possible value */

